fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период.ДатаНачала = НачалоМесяца(ОбщегоНазначения.ТекущаяДатаПользователя(СтандартныеПодсистемыСервер.ТекущийПользователь()));
		Период.ДатаОкончания = КонецМесяца(Период.ДатаНачала);
	КонецЕсли;
	
	ЗаполнитьКалендарьНаСервере();
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗаполнитьКалендарьНаСервере();
	
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКалендарьНаСервере()

	Календарь.ТекущиеПериодыОтображения.Очистить();
	Календарь.ТекущиеПериодыОтображения.Добавить(Период.ДатаНачала, Период.ДатаОкончания);
	Календарь.ВыравниватьГраницыЭлементовПоШкалеВремени = Истина;
	
	ИзмеренияКалендаря = Календарь.Измерения;
	ИзмеренияКалендаря.Очистить();
	
	ИзмерениеСпециалисты = ИзмеренияКалендаря.Добавить("Специалисты");
	
	ЭлементыКалендаря = Календарь.Элементы;
	ЭлементыКалендаря.Очистить();

	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка КАК Ссылка,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент.Представление КАК КлиентПредставление,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.Представление КАК ДоговорПредставление,
		|	ВКМ_ОбслуживаниеКлиентов.Специалист.Представление КАК СпециалистПредставление,
		|	ВКМ_ОбслуживаниеКлиентов.ОписаниеПроблемы КАК ОписаниеПроблемы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйСпециалист = ИзмерениеСпециалисты.Элементы.Добавить(Выборка.Специалист);
		НовыйСпециалист.Текст = Выборка.СпециалистПредставление;
		
		СоответствиеЗначений = Новый Соответствие;
		СоответствиеЗначений.Вставить("Специалисты", Выборка.Специалист);
		
		РазницаВремениНачало = Выборка.ВремяНачалаРабот - НачалоДня(Выборка.ВремяНачалаРабот);
		РазницаВремениКонец = Выборка.ВремяОкончанияРабот - НачалоДня(Выборка.ВремяОкончанияРабот);
		НачалоДаты = НачалоДня(Выборка.ДатаПроведенияРабот);
		
		ДатаВремяНачало =НачалоДаты + РазницаВремениНачало;//Выборка.ВремяНачалаРабот;
		ДатаВремяОкончание = НачалоДаты + РазницаВремениКонец;//Выборка.ВремяОкончанияРабот;
		
		НовыйЭлемент = ЭлементыКалендаря.Добавить(ДатаВремяНачало, ДатаВремяОкончание);
		НовыйЭлемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(СоответствиеЗначений);
		НовыйЭлемент.Текст = СтрШаблон("%1 [%2]",Выборка.КлиентПредставление, Выборка.ОписаниеПроблемы);
		//НовыйЭлемент = ЭлементыКалендаря.Добавить(Выборка.ВремяНачалаРабот, Выборка.ВремяОкончанияРабот);
		НовыйЭлемент.Значение = Выборка.Ссылка;
		НовыйЭлемент.ЦветФона = WebЦвета.БледноЗеленый;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
